#!/usr/bin/env bash
# ------------------------------------------------------------------------ #
# Script Name:   par_impar.sh
# Description:   Verifica se um número é par ou ímpar
# Site:          https://github.com/Mikaziel
# Written by:    Miguel Dias
# Maintenance:   Miguel Dias
# ------------------------------------------------------------------------ #
# Usage:         $ ./par_impar.sh
# ------------------------------------------------------------------------ #
# History:       v1.0 15/04/2026 - Miguel: Initial version
# ------------------------------------------------------------------------ #

# VARIABLES --------------------------------------------------------------- #

# FUNCTIONS --------------------------------------------------------------- #

# CODE -------------------------------------------------------------------- #
read -p "Diga um valor: " valor

if [ $((valor % 2)) -eq 0 ]; then
    echo "$valor é par"
else
    echo "$valor é impar"
fi

# END --------------------------------------------------------------------- #